In [111]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [112]:
df_movies= pd.read_csv("../data/ml-latest/movies.csv")
df_ratings= pd.read_csv("../data/ml-latest/ratings.csv").drop(columns="timestamp")

In [113]:
df_movies.describe()

             movieId
count   86537.000000
mean   155932.817096
std     78037.145347
min         1.000000
25%    111443.000000
50%    164574.000000
75%    211225.000000
max    288983.000000

In [114]:
df_ratings.describe()

             userId       movieId        rating
count  3.383216e+07  3.383216e+07  3.383216e+07
mean   1.654380e+05  2.831348e+04  3.542540e+00
std    9.534122e+04  4.992865e+04  1.063959e+00
min    1.000000e+00  1.000000e+00  5.000000e-01
25%    8.295300e+04  1.219000e+03  3.000000e+00
50%    1.661290e+05  3.263000e+03  4.000000e+00
75%    2.474500e+05  4.049100e+04  4.000000e+00
max    3.309750e+05  2.889830e+05  5.000000e+00

In [115]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33832162 entries, 0 to 33832161
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   userId   int64
 1   movieId  int64
 2   rating   float64
dtypes: float64(1), int64(2)
memory usage: 774.4 MB

In [116]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86537 entries, 0 to 86536
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  86537 non-null  int64
 1   title    86537 non-null  object
 2   genres   86537 non-null  object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [117]:
print(df_ratings['userId'].max(), df_ratings['movieId'].max())

330975 288983

In [118]:
df_movies.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [119]:
df_ratings.head(10)

   userId  movieId  rating
0       1        1     4.0
1       1      110     4.0
2       1      158     4.0
3       1      260     4.5
4       1      356     5.0
5       1      381     3.5
6       1      596     4.0
7       1     1036     5.0
8       1     1049     3.0
9       1     1066     4.0

## Top 10 rated films

In [120]:
most_rated_movies= df_ratings.groupby("movieId").size().sort_values(ascending=False).head(10)
df_most_rated_movies = pd.DataFrame(most_rated_movies, columns= ["rating_count"])
df_most_rated_movies_titles= df_most_rated_movies.merge(df_movies, on= "movieId")

In [121]:
df_most_rated_movies_titles

,movieId,rating_count,title,genres
0,318,122296,"Shawshank Redemption, The (1994)",Crime|Drama
1,356,113581,Forrest Gump (1994),Comedy|Drama|Romance|War
2,296,108756,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
3,2571,107056,"Matrix, The (1999)",Action|Sci-Fi|Thriller
4,593,101802,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller
5,260,97202,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi
6,2959,86207,Fight Club (1999),Action|Crime|Drama|Thriller
7,527,84232,Schindler's List (1993),Drama|War
8,480,83026,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller
9,1196,80200,Star Wars: Episode V - The Empire Strikes Back...,Action|Adventure|Sci-Fi

## Mean for the top 10 most rated movies

In [122]:
movieindex= [index for index in df_most_rated_movies_titles["movieId"]]

In [123]:
movieindex

[318, 356, 296, 2571, 593, 260, 2959, 527, 480, 1196]

In [124]:
top_10_ratings = df_ratings[df_ratings['movieId'].isin(movieindex)]
top_10_ratings

          userId  movieId  rating
3              1      260     4.5
4              1      356     5.0
10             1     1196     3.5
26             1     2571     2.5
113            2      296     5.0
...          ...      ...     ...
33831871  330975      480     2.5
33831877  330975      527     3.5
33831890  330975      593     3.0
33831937  330975     1196     2.5
33832048  330975     2571     3.0

[984358 rows x 3 columns]

In [125]:
mean_rating= top_10_ratings.groupby("movieId")["rating"].mean()
mean_rating

movieId
260     4.092400
296     4.191778
318     4.416792
356     4.068189
480     3.689013
527     4.242337
593     4.150287
1196    4.118030
2571    4.160631
2959    4.236019
Name: rating, dtype: float64

In [126]:
df_mean_rating= pd.DataFrame(mean_rating)
df_mean_rating

           rating
movieId
260      4.092400
296      4.191778
318      4.416792
356      4.068189
480      3.689013
527      4.242337
593      4.150287
1196     4.118030
2571     4.160631
2959     4.236019

In [127]:
df_mean_most_rated= df_most_rated_movies_titles.merge(df_mean_rating, on="movieId").rename(columns= {"rating": "mean_rating"})

In [128]:
df_mean_most_rated

,movieId,rating_count,title,genres,mean_rating
0,318,122296,"Shawshank Redemption, The (1994)",Crime|Drama,4.416792
1,356,113581,Forrest Gump (1994),Comedy|Drama|Romance|War,4.068189
2,296,108756,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller,4.191778
3,2571,107056,"Matrix, The (1999)",Action|Sci-Fi|Thriller,4.160631
4,593,101802,"Silence of the Lambs, The (1991)",Crime|Horror|Thriller,4.150287
5,260,97202,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi,4.092400
6,2959,86207,Fight Club (1999),Action|Crime|Drama|Thriller,4.236019
7,527,84232,Schindler's List (1993),Drama|War,4.242337
8,480,83026,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller,3.689013
9,1196,80200,Star Wars: Episode V - The Empire Strikes Back...,Action|Adventure|Sci-Fi,4.118030

## Plot total made films per year

In [129]:
years= df_mean_most_rated["title"]

In [130]:
years

0                     Shawshank Redemption, The (1994)
1                                  Forrest Gump (1994)
2                                  Pulp Fiction (1994)
3                                   Matrix, The (1999)
4                     Silence of the Lambs, The (1991)
5            Star Wars: Episode IV - A New Hope (1977)
6                                    Fight Club (1999)
7                              Schindler's List (1993)
8                                 Jurassic Park (1993)
9    Star Wars: Episode V - The Empire Strikes Back...
Name: title, dtype: object